{
  "name": "Michael Anokye",
  "profilePic": "profilePic.jpg",
  "email": "michaelanokyej@yahoo.com",
  "address": "Rockville, MD",
  "introText": "A Multi-faceted software engineer who is knowledgeable in",
  "heroProgammingLangs": "['JavaScript',1000,'ReactJs',1000,'NodeJs',1000,'Python',1000,'MongoDB',1000,'Ruby',1000,'Rails',1000,'PHP',1000,'Laravel',1000,'RESTful APIs',1000,'GraphQL',1000,'AWS',1000,'SQL',1000,'CI/CD',1000,'HTML',1000,'CSS',1000]",
  "phone": "+15715528289",
  "resumepdf": "my-resume.pdf",
  "skills": [
    {
      "category": "JavaScript Frameworks",
      "items": [
        "ReactJS",
        "Node.js",
        "Jquery",
        "ExpressJS"
      ]
    },
    {
      "category": "Testing Frameworks",
      "items": [
        "Jasmine",
        "Karma",
        "Mocha",
        "Chai"
      ]
    },
    {
      "category": "Scripting Technology",
      "items": [
        "Python",
        "BASH",
        "Batch"
      ]
    },
    {
      "category": "Database",
      "items": [
        "MySQL",
        "PostgreSQL",
        "MongoDB"
      ]
    },
    {
      "category": "Amazon Web Services",
      "items": [
        "EC2",
        "ELB",
        "API Gateway",
        "S3"
      ]
    },
    {
      "category": "Additional Skills",
      "items": [
        "API development skills (REST)"
      ]
    }
  ],
  "qualifications": [
    {
      "name": "Amazon AWS Certified Developer",
      "link": "https://www.certmetrics.com/amazon/public/transcript.aspx?transcript=Z8VB12F21E141YSM"
    },
    {
      "name": "Cisco Certified Network Associate (CCNA)",
      "link": "https://www.youracclaim.com/badges/9599f28d-0590-4708-bec9-1fdca5129810/public_url"
    },
    {
      "name": "Thinkful Engineering Immersion Program",
      "date": "March, 2020"
    }
  ],
  "projects": [
    {
      "title": "Evently WebApp",
      "description": "A webapp for users to book and manage events",
      "image": "evently.png",
      "features": [
        "Users can sign up/in",
        "Users can book events.",
        "Users can create events.",
        "Users can cancel events."
      ],
      "stack": [
        "faHtml5",
        "faCss3",
        "faNode",
        "faReact",
        "faDatabase"
      ],
      "liveLink": "https://evently-michael-anokye.netlify.app/",
      "codeLink": "https://github.com/michaelanokyej/event-booking-client"
    },
    {
      "title": "Wander WebApp",
      "description": "A webapp for users that wander and find new places.",
      "image": "wander.png",
      "features": [
        "Users can search for tours in every state in the USA",
        "New users can sign up to book tours.",
        "Old users can sign in too book tours.",
        "A registered user can become a guide by posting a tour."
      ],
      "stack": [
        "faHtml5",
        "faCss3",
        "faNode",
        "faReact",
        "faDatabase"
      ],
      "liveLink": "https://wander-client.michaelanokyej.now.sh/",
      "codeLink": "https://github.com/michaelanokyej/wander-client"
    },
    {
      "title": "UpLift WebApp",
      "description": "A webapp to make mentorship accessible to users.",
      "image": "upLift-home.png",
      "features": [
        "Users can sign up/sign in.",
        "Users can post something.",
        "Users can comment on posts",
        "Users can send messages"
      ],
      "stack": [
        "faHtml5",
        "faCss3",
        "faNode",
        "faReact",
        "faDatabase"
      ],
      "liveLink": "https://uplift-olive.now.sh/",
      "codeLink": "https://github.com/irodriguez20/team-mike-india-client"
    },
    {
      "title": "Oper Dashboard",
      "description": "A dashboard to log and generate error reports.",
      "image": "oper-dashboard.png",
      "features": [
        "Users can log an error.",
        "Users can view all operations.",
        "Users are presented with 2 charts.",
        "Users can add a user and an operation.",
        "Users can generate a .csv file report."
      ],
      "stack": [
        "faHtml5",
        "faCss3",
        "faNode",
        "faReact",
        "faDatabase"
      ],
      "liveLink": "https://oper-dashboard-michael-anokye.netlify.app/",
      "codeLink": "https://github.com/michaelanokyej/oper-dashboard"
    },
    {
      "title": "Private Chat App",
      "description": "A webapp for users to instantly chat, privately.",
      "image": "./project-gifs/private-chat-demo.gif",
      "features": [
        "Users can register.",
        "Users can create a room.",
        "Any user with a room name can join room.",
        "Users are alerted when others join and/or leave."
      ],
      "stack": [
        "faHtml5",
        "faCss3",
        "faNode",
        "faReact"
      ],
      "liveLink": "https://private-chat-michael-anokye.netlify.app/",
      "codeLink": "https://github.com/michaelanokyej/instantMessaging-client"
    },
    {
      "title": "Covid-19 Tracker",
      "description": "A webapp for Covid 19 globally.",
      "image": "covid-19-tracker.png",
      "features": [
        "Users can get global statistics.",
        "Users can get country-specific statistics.",
        "Users can see the trend of cases over time.",
        "Users can compare statistics between countries."
      ],
      "stack": [
        "faHtml5",
        "faCss3",
        "faNode",
        "faReact"
      ],
      "liveLink": "https://covid-19-tracker-michael-anokye.netlify.app/",
      "codeLink": "https://github.com/michaelanokyej/covid-19-tracker"
    }
  ],
  "aboutMe": {
    "title": "About Me",
    "quote": "As a first generation college graduate, I always found it very difficult to navigate the corporate world so I have always been eager to create products that help and uplift people like me. This is the reason why I am working on a personal project that will make mentorship accessible and available to anyone with a cell phone and internet (click here to view project). I am a true team player offering multiple years of experience in the software industry. Proficient in working with diverse languages.",
    "more": [
      "I have a strong passion for software development so before I started writing code, I learnt hardware first just to get know how the whole infrastructure of connected computers work. Now I can confidently say I know how software and hardware seamlessly interact with each other.",
      "I bring about 5 years of professional experience: 2 years in network engineering and hardware deployments which makes me very knowledgeable about how best to secure connections and most effective ways to deploy code. And 3 years in the software industry: working with multiple languages such as Python, Ruby, PHP, SQL and Javascript and more.",
      "As an Application Developer at Data Storage Science, I am on the development team responsible for building and maintaining big data driven ReactJs applications tailored to the needs of the US Patent & Trademark Office.",
      "Also, as a Full Stack Developer at Ringo Cars, I am on the development team to create a new environment for the company using React.js for the client and Node.js for the server architecture with a SQL database. Because of my previous experience at data centers and with deployments, I am sort of a consigliere for the DevOps team.",
      "Again, as a Software Analyst at Legal General America, I assist in the deployment and maintenance of all in-house applications. I also assist in updating our MySQL database when needed and last but not the least, I am solely developing an error logger for my team to be able to log all the errors we get daily so the development team can adequately fix them.",
      "fastly, as the Lead Remote Hands Technician at Digital Realty, among other things, I was responsible for advising customers such as PNC, Starbucks, Symantec, Nutanix etc on what hardware to deploy and also assisted in configuration of these devices.",
      "When I'm not coding, I enjoy doing something creative like painting or being physically active in the gym. I hope you enjoy taking a look around my portfolio, and please don't hesitate to..."
    ]
  },
  "resume": {
    "section1": {
      "title": "Summary",
      "text": "Multi-faceted software engineer who is knowledgeable in JavaScript, Ruby, PHP, Python, MySQL, HTML, etc. A true team player offering multiple years of experience in the software industry. Seeking the opportunity to provide outstanding, clean code in a collaborative environment. Proficient in working with diverse languages. Motivated to stay informed of latest industry innovations to provide customers/users with most up-to-date solutions. Capable of working in high-pressure environments while meeting business needs and project expectations​."
    },
    "section2": {
      "title": "SKILLS",
      "list1": [
        "Extensive knowledge in HTML, CSS, Ruby, PHP, JavaScript, React.js, Node.js etc.",
        "Extensive knowledge in Databases; MongoDB, PostgreSQL, Oracle DB, MySQL etc",
        "Experience scripting in python, batch and bash"
      ],
      "list2": [
        "Experience working with Git and Github",
        "Experience with testing technologies such as Mocha, Chai, Jasmine, Karma, Webpack, Browserify, Heroku, Enzyme.",
        "Hosting, Deployment & Maintenance"
      ]
    },
    "section3": {
      "title": "Experience",
      "content": [
        {
          "title": "Application Developer | Data Storage Science | December 2020 – Present",
          "list": [
            "Building and maintaining big data driven ReactJs applications tailored to the needs of the US Patent & Trademark Office",
            "Building and maintaining in-house APIs to access database",
            "Using Tableau to visualize data",
            "Using AWS EC2 and S2 to create custom solutions for clients"
          ]
        },
        {
          "title": "Software Engineer (Sup) | Learn Platform | December 2020 – Present",
          "list": [
            "Develop features per customer and PM request",
            "Finding and fixing bugs in the main platform built on React, Ruby and PostgreSQL",
            "Updating database with client data when manually intervention is required",
            "Automating redundant support issues",
            "Monitor resources and errors with New Relic and Roll bar",
            "Create and troubleshoot scripts to automate redundant tasks."
          ]
        },
        {
          "title": "Software Analyst | Legal General America | October, 2019 TO December, 2020",
          "list": [
            "Deploying in-house applications",
            "Developing an in-house error logger for all in house applications",
            "Designing and developing a scalable virtual environment for Operations team.",
            "Updating and maintaining an SQL database.",
            "Create and troubleshoot scripts to automate redundant tasks."
          ]
        },
        {
          "title": "Full Stack Developer - REMOTE | RingoCars & Autoparts | April, 2019 – December, 2020",
          "list": [
            "Developing and Designing Solutions using Agile Software Development Methodology (Scrum and Kanban)",
            "Using React for the front end client",
            "Building the API/Backend of company website with NODEJS / EXPRESS Building the company database with POSTGRESQL",
            "Collaborate with the rest of the engineering team using Git to design and launch new features."
          ]
        },
        {
          "title": "Remote Hands Technician - LEAD | Digital Realty | July, 2017 – October, 2019",
          "list": [
            "Assisted customers with the basic-mid level configuration assistance of routers, servers and switches to include naming, IP addressing, service turn ups, vlan creations, etc.",
            "Monitored the data center's mission critical infrastructure with the use of monitoring systems and inventory databases",
            "Provided timely customer and internal updates using a computer based ticketing system",
            "Assist customers with the diagnosis of hardware and software to include but not limited to iLO, iDrac, IOS configurations; server components such as WCM, WCB, motherboards, CPUs, fan modules, heat sinks, etc. on their network equipment"
          ]
        }
      ]
    }
  },
  "icons": {
    "html5": "faHtml5",
    "css3": "faCss3",
    "node": "faNode",
    "react": "faReact",
    "db": "faDatabase",
    "location": "faMapMarkerAlt",
    "road": "faRoad",
    "phone": "faMobileAlt",
    "download": "faDownload",
    "envelope": "faEnvelope"
  }
}